In [6]:
import pandas as pd
import sqlalchemy
import pyodbc

In [15]:
#engine = sqlalchemy.create_engine('mssql+pymssql://DANNYWAHYUDI-PC//DotNetCore')
#df = pd.read_sql_table("Employees",engine)

sql_conn = pyodbc.connect('DRIVER={SQL Server};SERVER=DANNYWAHYUDI-PC;DATABASE=DotNetCore;Trusted_Connection=yes')
query = "SELECT * FROM [Employees]"
df = pd.read_sql(query, sql_conn)
df

   StudentId EmpName  EmpAge EmpCity EmpCountry
0          1    Neel      27    Pune      India
1          2   Neel2      27    Pune      India
2          3   Neel3      27    Pune      India